gamma=0.8075;
rho=0.1212;
nu=0.15*1e-4;
D=0.195;
F=0.5;
a=1.12;
mu=0.992;
S=3.141592*D^2/4;
cmean=1.48;
c1=1/(gamma*mu*F*S)*1e-3;
h=[151 139 129 119 103 95 84 71 57 49 38 22;
    152 141 128 118 108 96 84 72 58 49 38 22;
    151 138 129 118 108 99 89 77 62 45 32 20;
    154 147 140 131 123 111 97 89 82 72 50 20;
    150 137 126 115 105 95 82 73 60 47 38 21];
X=[1741 1525 1335 1332 1135 1042 922 814 631 540 500 308;
    746 670 610 563 516 471 429 377 305 265 219 143;
    708 624 560 528 510 470 430 348 321 236 154 114;
    610 570 550 510 490 460 420 400 360 320 230 110;
    500 450 415 370 355 340 290 255 223 175 145 90];
v=sqrt((2*gamma*mu*F.*h)/rho);
cx=c1*a*(X-cmean*h)./h;
Re=D.*v/nu;
q1=[225 200 180 160 140 140 119 106 86 66 55 35];
h1=[149 137 126 113 105 91 80 68 60 47 37 21];

figure;
grid on
plot(h1, q1,'LineWidth', 1.5)
grid on
xlabel("h, мм");
ylabel("q, гС");

figure;
grid on
hold on
for i=1:5
    plot(h(i,:), X(i,:),'LineWidth', 1.5)
end;
xlabel("h, мм");
ylabel("X, гС");
legend("цилиндр", "конус+цилиндр","полушар+цилиндр","конус+цилиндр+полушар","полушар+цилиндр+конус");

figure;
grid on
hold on
for i=1:5
    plot(Re(i,:), cx(i,:),'LineWidth', 1.5)
    set(gca,'XTick',[0:0.1*1e5:5*1e5],'YTick',[0:0.1:2])
end;
xlabel("Re");
ylabel("C_x");
xlim([1.5*1e5, 4.2*1e5]);
legend("цилиндр", "конус+цилиндр","полушар+цилиндр","конус+цилиндр+полушар","полушар+цилиндр+конус");